app/controllers/api/v1/userdata_controller.rb

	 def me
	    @user = User.where(netid: session[:cas_user]).first
---
SELECT "users".* FROM "users" WHERE "users"."netid" = 'dz85' ORDER BY "users"."id" ASC LIMIT 1